In [2]:
tmdb_similar_movies = context.catalog.load("tmdb_similar_movies")

2021-02-16 20:58:35,137 - kedro.io.data_catalog - INFO - Loading data from `tmdb_similar_movies` (SQLQueryDataSet)...

In [3]:
tmdb_similar_movies.head()

   movie_id  similar_movie_id
0       671               674
1       671            198663
2       671            287947
3       671            333339
4       671            466282

In [14]:
similar_movie_list = tmdb_similar_movies.groupby("movie_id")["similar_movie_id"].apply(list).apply(lambda x: x[:5])

In [15]:
import pandas as pd

test_data = pd.DataFrame({
    "movie_id": similar_movie_list.index,
    "similar_movie_list": similar_movie_list
})
test_data.head()

          movie_id                        similar_movie_list
movie_id
671            671     [674, 198663, 287947, 333339, 466282]
674            674     [671, 198663, 333339, 466282, 568160]
808            808                          [330457, 532067]
20982        20982  [505262, 568160, 592350, 635302, 655431]
24428        24428   [99861, 141052, 284053, 284054, 287947]

In [13]:
test_data.size

248

In [21]:
test_data[test_data.apply(lambda x: len(x["similar_movie_list"]), axis=1) == 5]

2021-02-16 21:12:51,202 - numexpr.utils - INFO - NumExpr defaulting to 8 threads.

          movie_id                        similar_movie_list
movie_id
671            671     [674, 198663, 287947, 333339, 466282]
674            674     [671, 198663, 333339, 466282, 568160]
20982        20982  [505262, 568160, 592350, 635302, 655431]
24428        24428   [99861, 141052, 284053, 284054, 287947]
99861        99861   [24428, 141052, 284053, 284054, 287947]
...            ...                                       ...
655431      655431   [38700, 274855, 399579, 535292, 631132]
656563      656563  [333339, 398818, 466282, 537915, 565426]
721656      721656     [671, 398818, 454626, 513584, 615677]
732450      732450    [24428, 99861, 141052, 284053, 284054]
775996      775996  [198663, 290859, 333339, 399579, 461130]

[66 rows x 2 columns]